MatheusCipolotti/STM32_MQTT_Project/Software/MQTT_Project/Ethernet_W5500/wizchip_port.c
/*
 * wizchip_port.c
 *
 *  Created on: 21 de abr. de 2026
 *      Author: matheus-cipolotti
 */

#include "stm32g0b0xx.h"

#include "MCU.h"
#include "SPI.h"

#include "wizchip_conf.h"
#include "wizchip_port.h"

#include "socket.h"

//Configura rede
wiz_NetInfo netinfo = {
	.mac = {0x00,0x08,0xdc,0x01,0x02,0x03},
	.ip  = {192,168,0,123},
	.sn  = {255,255,255,0},
	.gw  = {192,168,0,1},
	.dns = {8,8,8,8},
	.dhcp = NETINFO_STATIC										//IP Fixo
};

uint8_t W5500_Init(void){
	uint8_t version;

	//===== RESET Inicial =====
	wizchip_reset();

	//===== Teste de Integridade =====
	version = getVERSIONR();

	//W5500 detectado
	if(version == 0x04){
		//===== Callback dos perifericos =====
		reg_wizchip_cs_cbfunc(wizchip_select, wizchip_deselect);
		reg_wizchip_spi_cbfunc(spi2_readbyte, spi2_writebyte);

		uint8_t txSize[8] = {2,2,2,2,2,2,2,2};
		uint8_t rxSize[8] = {2,2,2,2,2,2,2,2};

		wizchip_init(txSize, rxSize);
		wizchip_setnetinfo(&netinfo);

		//===== Configura um servidor TCP =====
		//Cria o Socket
		// 0 - Numero do Socket
		// Sn_MR_TCP - Modo do Socket (TCP)
		// 5000 - Porta Local
		// 0 - Flags
		socket(0, Sn_MR_TCP, 5000, 0);

		//Socket em modo servidor TCP
		listen(0);												//nao bloqueante
	}

	//W5500 erro
	else{

	}

	return version;
}

void wizchip_reset(void){
	W5500_RST_LOW();
	Delay_ms(1000);

	W5500_RST_HIGH();
	Delay_ms(2000);
}

void wizchip_select(void){
	W5500_CS_LOW();
}

void wizchip_deselect(void){
	W5500_CS_HIGH();
}

uint8_t spi2_readbyte(void){
    return SPI2_Transfer(0xFF);
}

void spi2_writebyte(uint8_t wb){
    SPI2_Transfer(wb);
}
